Table of Contents
 Enum TypeOfSupportConditions
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Define type of support conditions
public enum TypeOfSupportConditions
Fields
Bearing = 3
Bearing provided
Cantilever = 4
Cantilever
Continuous = 1
Continuous members
FullyRestrained = 2
Supports considered fully restrained
NonContinuous = 0
Non-continuous members
Fields
 Name |  Description
 Bearing = 3
Bearing provided
 Cantilever = 4
Cantilever
 Continuous = 1
Continuous members
 FullyRestrained = 2
Supports considered fully restrained
 NonContinuous = 0
Non-continuous members
 Edit this page